In [7]:
import pandas as pd

In [11]:

dic={"A":pd.Series([2,3,4,5,6]),"B":pd.Series([5,2,5,6,6])}
var=pd.DataFrame(dic)
var

   A  B
0  2  5
1  3  2
2  4  5
3  5  6
4  6  6

# insertion data var.insert(column index,"name",data)

In [12]:
var.insert(1,"A*2",var["A"]*2)
var

   A  A*2  B
0  2    4  5
1  3    6  2
2  4    8  5
3  5   10  6
4  6   12  6

# Delete data

In [28]:
var.pop("D")

0    2
1    3
2    4
3    5
4    6
Name: D, dtype: int64

In [30]:
del var["B"]

In [31]:
var

   A  A*2
0  2    4
1  3    6
2  4    8
3  5   10
4  6   12

In [32]:
var["copy"]=var["A"][:3]
var

   A  A*2  copy
0  2    4   2.0
1  3    6   3.0
2  4    8   4.0
3  5   10   NaN
4  6   12   NaN

In [34]:
var.isnull().sum()

A       0
A*2     0
copy    2
dtype: int64

In [35]:
arr=[]
arr1=[]
arr2=[]
for i in range(0,3):
    name=input("enter your name: ")
    arr.append(name)
    rollno=int(input("enter rol no: "))
    arr1.append(rollno)
    marks=int(input("enter your marks: "))
    arr2.append(marks)
dic1={"name":arr,"rollno":arr1,"marks":arr2}
var1=pd.DataFrame(dic1)

enter your name:  luke
enter rol no:  23
enter your marks:  450
enter your name:  mike
enter rol no:  24
enter your marks:  300
enter your name:  jack
enter rol no:  389
enter your marks:  25

In [36]:
var1

   name  rollno  marks
0  luke      23    450
1  mike      24    300
2  jack     389     25